var lang = {};

    lang.ext = 'ru'

    lang.logotext = 'КРИПТО ТАНКИ'

    lang.nav = {
        nav_1: 'ОБ ИГРЕ',
        nav_2: 'ПРЕДПРОДАЖА',
        nav_3: 'ЭТАПЫ',
        nav_4: 'МОНЕТА',
        nav_5: 'СООБЩЕСТВО'
    }

    lang.block_about = {
        header: 'Зарабатывай применяя своё мастерство',
        items: [{
            header: 'Что такое крипто-танки?',
            description: `
                Это мультиплеерная онлайн-игра в которой просходит сражение из 20 танко в режиме PVP Все-Против-Всех.
            `
        },{
            header: 'Сколько длиться сражение?',
            description: `
                Время для каждой битвы( независимо от уровня ) ограниченно и составляет 20 минут. Победители разделят приз между собой.
            `
        },{
            header: 'Что будет, если мой танк подобьют?',
            description: `
                Ваш танк будет находиться в своем ангаре в состоянии ремонта 24 часа. Потом его снова можно использовать в сражении.
            `
        },{
            header: 'Можно ли после крушения использовать другой танк в текущем сражении?',
            description: `
                Нет. Это невозможно и не планируется в дальнейшем. Возможно след-поражения будет препятствием для других танков, но это неточно.
            `
        },{
            header: 'Что будет, если мой танк станет победителем?',
            description: `
                Вы можете снова "заправить его" и отправить в следующие сражение.
            `
        },{
            header: 'Сколько танков я могу купить и использовать. Есть ли ограничения по кол-ву?',
            description: `
                Ограничению по кол-ву танков, ангаров - нет. В вашем владении может быть любое кол-во танков.
            `
        },{
            header: 'Будет ли точки защиты или штаб в игре?',
            description: `
                Нет. Игра в режиме PVP Все-Против-Всех. Использваотение ШТАБа в качестве обороной точки не имеет какого либо смысла. 
                Конечная цель - выжить, став победителем или хотя бы забрать как можно больше танков перед своим поражением.
            `
        },{
            header: 'В чем основной замысел PVP-Сражения?',
            description: `
                Каждый танк, который терпит крушение - теряет свои топливные еденицы, большая часть(~2/3) которых переходит на ваш склад. 
                Остальная часть остаётся на поле битвы и отправляется на склад победителя.
            `
        },{
            header: 'Что такое топливные еденицы (ТЕ)?',
            description: `
                Это игровое топливо. В зависимости от мощности, редкости и уровня танка - ему требуется определенное кол-во (ТЕ) перед отправкой
                на поле битвы. ТЕ в баке танка, хватает ровно на 20 минут. Например если танк был подбит кем-то на 10 минуте, то расчёт 
                прибыли подбивателя будет производиться из 50% запасов топлива подбиваемого. Топливные еденицы покупаются за криптовалюту игры 
                и имеют обратный обмен.
            `
        },{
            header: 'Будет ли применяться ОРАКУЛ?',
            description: `
                Нет. И вводить не планируется. Но вводить будем если в этом увидим необходимость.
            `
        },{
            header: 'Есть ли определённые сроки выхода игры?',
            description: `
                Мы очень хотим запустить игру в первый день весны. Это позволит нам привязать дату запуска к сезону, к весне. 
                Хотя понимаем что работы еще предстоит много, и проработка всех механизмов которые мы хотим показать вам в общей 
                композиции при запуске еще хватает.... В любом случае - есть этапы работ по которым вы можете иметь примерное 
                понимание на сколько мы близки к запуску.
            `
        },{
            header: 'Причем здесь BattleCity?',
            description: `
                Многие в нашей команде буквально выросли играя в такую игру еще в своём детстве. Мы вдохновлены и хотим 
                подарить продолжение этой великолепной идеей игры. Мы не хотим координально менять интерфейс, а лишь дополнить 
                игру мультиплеерным режимом и дать возможность материализации своих побед.
            `
        },{
            header: 'Есть ли ограничения по возрасту?',
            description: `
                Игра связанна с криптовалютой и деньгами. Поэтому мы настоятельно рекомендуем играть в нашу игру в тайне от своих 
                детей. Но уж если так получилось - пусть риски связанные с финансовыми потерями будут на ваших плечах, а своими в 
                этом случае мы можем лишь пожать.
            `
        },{
            header: 'Можно ли продать свой танк кому либо?',
            description: `
                Это будет доступно используя внутренний маркетплейс игры. Но доступен он будет чуть позже после выхода PVP режима.
            `
        },{
            header: 'Каких противников мне ожидать на поле битвы?',
            description: `
                Это будут танки уровня вашего танка, не ниже и не выше. У каждого уровня есть показатели выбивания и убытка в случае 
                крушения. Чем выше уровень, тем больше топлива требуется для битвы и выше доход.
            `
        },{
            header: 'Какие навыки мне пригодятся перед игрой?',
            description: `
                Мы рекомендуем вам поиграть в BattleCity. Мы закрепили его на этом сайте рядом с кнопками переводов. 
                Просто нажмите Ентер - для запуска и стрелочки для управления. Пробелом можно выпускать сняряд.
            `
        },{
            header: 'У меня есть GamePad, могу ли я использовать его?',
            description: `
                Конечно! Любой современный браузер способен определить GamePad. С ним ваши шансы на победу будут гораздо выше!
            `
        },{
            header: 'Как выбрать NFT?',
            description: `
                Чем выше уровень, тем большее колличество топливных едениц вы будете выбивать из противников. Соответственно при обмене вы получите
                больше криптовалюты. Позже, вашу NFT при необходимости можно будет продать используя внутренний маркетплейс игры.
            `
        }]
    }
    
    lang.block_level = {
        header: 'Предворительная продажа NFT',
        level: 'Уровень',
        pribil: 'Прибыль при сокрушении',
        ubitok: 'Убыток при крушении',
        pobeditel: 'Прибыль победителя',
        kupitZa: 'Купить за',
        itog: 'В вашем владении:',
        rare_legendary: 'ЛЕГЕНДАРНЫЙ',
        rare_epic: 'ЭПИЧЕСКИЙ',
        rare_rare: 'РЕДКИЙ',
        rare_common: 'ОБЫЧНЫЙ',
        table_th_speed: 'Скорость',
        table_th_shild: 'Броня',
        table_th_damage: 'Урон',
        table_th_recharge: 'Перезарядка',
        tank_1_desc: `
            Обычный танк со стандартными пробивными способностями. 
            Небольшие показатели урона и небольшая подвижность. Хлипкость конструкции 
            компенсируется иконами на приборной панели.
        `,
        tank_2_desc: `
            Обычный танк с повышенным темпом стрельбы. 
            Кажется инженеры поймали баланс между
            колличеством брони не во вред скорости
        `,
        tank_3_desc: `
            Отличается высокой скоростью передвижения и быстрой 
            перезарядкой. Показатели брони сбалансированны
        `,
        tank_4_desc: `
            Тяжёлый танк с возможностью пробивать бетонные стены. 
            Небольшая подвижность компенсируется убойной силой 
            и быстрой перезарядкой.
        `,
    }
    
    lang.block_steps = {
        header: 'Этапы работ',
        items: [
            {
                date: 'Декабрь, 2021',
                items: [
                    `✔ Идея`,
                    `✔ Поиск и привлечение специалистов`,
                    `✔ Разработка концепции, правил, экономики`,
                    `✔ Технологии для реализации`,
                    `✔ Подготовка этапов работ и маркетинг-плана`
                ]
            },
            { 
                date: 'Январь, 2022',
                items: [
                    `✔ Разработка контракта для NFT предметов`,
                    `✔ Разработка контракта криптовалютной монеты`,
                    `🔨 Разработка интерфейса аккаунта и онлайн режима`,
                    `🔨 Разработка посадочной страницы для привлечения игроков и инвесторов к проекту`,
                    `⏱ Создание telegram канала для публикации новостей`
                ]
            },
            {
                date: 'Февраль, 2022',
                items: [
                    `⏱ Деплой подготовленных контрактов в MAINET сеть`,
                    `⏱ Привлечение игроков и инвесторов из схожих проектов`,
                    `⏱ Предпродажа NFT и сбор ликвидности для токена`,
                    `⏱ Запуск первой dev-версии для тестирования внутри команды`,
                    `⏱ Полное нагрузочное тестирование игры, поиск уязвимостей`
                ]
            },
            {
                date: 'Март, 2022',
                items: [
                    `⏱ Создание ликвидности для монеты. Запуск игры.`,
                    `⏱ Сбор обратной связи, устранение возможных проблем.`,
                    `⏱ Обсуждение командного режима игры`,
                    `⏱ Разработка концепции, правил, экономики`,
                    `⏱ Подготовка этапов работ и маркетинг-плана`
                ]
            }
        ]
    }

    lang.block_token = {
        header: 'Крипто Танки - Монета',
        contract: 'Официальный контракт:',
        desc: `
            Используйте CryptoTanks coin, что бы обменять её на топливо и участвовать в битвах. Вы так-же сможете
            менять полученное топливо в битвах обратно на монеты
        `,
        btn_text: 'Добавить монету в MetaMask'
    }

    lang.block_contacts = {
        header: 'Сообщество и новостной канал',
        desc: `
            В сообществе криптотанков, вы сможете обсуждать предстоящие битвы. А подписавшись на наш канал - вы будете
            в курсе новостей и в числе первых узнаете о выходе игры.
        `,
        btn_text1: 'Перейти в сообщество',
        btn_text2: 'Подписаться на канал'
    }

    lang.block_footer = {
        btn_top: 'Вверх',
        link_yur_1: `
            Мы не храним ваши данные и не используем файлы COOKIE. 
            Использование сайта и взаимодействие с контрактом как-либо предполагает что вы заранее ознакомились с нашими
        `,
        link_yur_2: 'условиями по предоставлению услуг'
    }

window.lang = lang
